
interface GameData {
  truths: string[];
  actions: string[];
}

export const gameData: GameData = {
  truths: [
    "Какой самый смелый поступок ты совершил(а)?",
    "Какая твоя самая большая мечта?",
    "О чем ты больше всего сожалеешь?",
    "Кто твой любимый человек и почему?",
    "Какой твой самый большой страх?",
    "Какой твой самый неловкий момент в жизни?",
    "О чем ты мечтал(а) в детстве?",
    "Какая твоя любимая книга или фильм?",
    "Что бы ты изменил в своей жизни, если бы мог?",
    "Какой самый странный комплимент ты когда-либо получал?",
    "Ты когда-нибудь тайно завидовал кому-то из своих друзей?",
    "Какой твой самый глупый поступок в детстве?",
    "Какой фильм или песня заставили тебя заплакать?",
    "Какое твое самое неловкое сообщение, отправленное по ошибке?",
    "Ты когда-нибудь врал другу, чтобы избежать встречи?",
    "Какая самая жёсткая ложь, в которую ты верил?",
    "Что самое странное, что ты гуглил, но никому не рассказываешь?",
    "Чего ты больше всего боишься потерять?",
    "Назови человека, которому ты завидуешь, и почему.",
    "Ты когда-нибудь специально игнорировал важное сообщение?",
    "С кем бы ты провёл ночь из людей, которые здесь играют?",
    "Что самое мерзкое ты когда-либо делал?",
    "Какой самый безумный закон ты бы придумал, если бы стал президентом?",
    "Ты проснулся в теле другого человека. Кем бы ты хотел стать хотя бы на день?",
    "Какой самый глупый спор у тебя был?",
    "Представь, что у тебя появилась суперспособность превращаться в предмет. Что бы это было?",
    "Если бы ты мог поменять правило в реальной жизни, что бы это было?",
    "Какое странное изобретение ты бы создал, если бы мог?",
    "Если бы ты мог один раз в жизни стать знаменитым, то в какой сфере?",
    "Какое самое неожиданное событие случилось с тобой за последние месяцы?",
    "Ты можешь загадать одно желание, но оно должно быть абсурдным. Что ты загадаешь?",
    "Если бы ты мог изменить одну мелочь в мире, что бы это было?",
    
  ],
  actions: [
    "Изобрази любимого животного",
    "Расскажи смешную шутку",
    "Изобрази известную личность",
    "Сделай комплимент каждому игроку",
    "Изобрази своего любимого персонажа из фильма или мультфильма.",
    "Покажи последний мем из твоей галереи.",
    "Придумай шутку на ходу.",
    "Поставь себе смешной никнейм и оставь его на 10 минут.",
    "Напиши своему другу: «Срочно! Ты любишь ананасы?» и не объясняй.",
    "Найди и покажи своё худшее фото за последние 3 года.",
    "Попробуй удержать взгляд с кем-то из игроков в течение 30 секунд.",
    "Напиши сообщение случайному контакту из телефона «Я всё знаю…»",
    "Съешь что-то необычное из холодильника вслепую.",
    "Открой галерею и покажи третье фото сверху.",
  ]
};
